Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: བདག་ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཀྱི་གླིང་དུ་ཡང་སོང་སྟེ་ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་བདག་གིས་ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཀྱི་གླིང་དུ་རྗེས་སུ་བསྟན་ན།
en: I went to the continent of Godānīya in the west, too. I ruled over the continent of Godānīya in the west for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: བྱང་གི་སྒྲ་མི་སྙན་ཅེས་བྱ་བའི་གླིང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་། མི་མང་པོས་རབ་ཏུ་གང་ལ།
en: But it is said that there is another continent, called Kuru in the north, which is rich, prosperous, peaceful, abundant in food, and full of many people.

source: གཞན་ཡང་མི་དེ་དག་ནི་བདག་གིར་བྱ་བ་མེད་པ། ཡོངས་སུ་འཛིན་པ་མེད་པ་ཞིག་ཡོད་ཅེས་གྲག་གིས།
en: Moreover, these people are free from both attachment and acquisitiveness.

source: མ་ལ་བདག་དེར་ཡང་སོང་ལ་རང་གི་དཔུང་གི་ཚོགས་ལ་རྗེས་སུ་བསྟན་པར་བྱའོ་སྙམ་པ་དང་། སེམས་བསྐྱེད་མ་ཐག་ཏུ་རྒྱལ་པོ་ང་ལས་ནུ་དཔུང་གི་ཚོགས་བྱེ་བ་བརྒྱད་འབུམ་དང་ཐབས་ཅིག་ཏུ་བུ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ནས་མདུན་ནས་འགྲོ་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ནམ་མཁའ་ལ་འཕགས་ཏེ་ཆས་པ་དང་། རྒྱལ་པོ་ང་ལས་ནུས་རི་རབ་ཀྱི་ངོས་ལོགས་ནས་ས་ཕྱོགས་དཀར་ཞིང་དཀར་བ་དག་མཐོང་ངོ་།
en: I will now go to that continent and there command my army.’ “As soon as he had thought this, King Māndhātṛ flew with an army of eight trillion up into the sky, surrounded by his thousand sons and preceded by his seven treasures. “When King Māndhātṛ

source: །མཐོང་ནས་ཀྱང་གནོད་སྦྱིན་ལྷ་གནས་ལ་སྨྲས་པ། ལྷ་གནས་ས་ཕྱོགས་དཀར་ཞིང་དཀར་བ་ཕ་བི་ཅི་ཞིག་ཡིན།
en: saw a white place beside Mount Sumeru, he asked the yakṣa Divaukasa, ‘Divaukasa, what is that white place?’

source: ལྷ་དེ་ནི་བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་རྣམས་ཀྱི་མ་རྨོས་མ་བཏབ་པའི་འབྲས་སཱ་ལུའི་འབྲུ་ལགས་ཏེ།
en: “ ‘Your Majesty, those are grains of rice of the people of Kuru in the north, which does not need plowing or sowing.

source: འདི་ལྟར་བྱང་གི་སྒྲ་མི་སྙན་པའི་མི་རྣམས་ནི་མ་རྨོས་མ་བཏབ་པའི་འབྲས་སཱ་ལུའི་འབྲུ་ལ་ལོངས་སྤྱོད་པ་ལགས་པས་ལྷ་ཡང་དེར་ཡང་གཤེགས་ནས་མ་རྨོས་མ་བཏབ་པའི་འབྲས་སཱ་ལུའི་འབྲུ་ལ་ལོངས་སྤྱོད་པར་འགྱུར་ལགས་སོ།
en: Thus, the people of Kuru in the north enjoy rice that does not need plowing or sowing. Go there, Your Majesty, and you will enjoy such a kind of rice, too.’

source: །རྒྱལ་པོ་ང་ལས་ནུས་ཐོས་ནས་ཀྱང་བློན་པོ་རྣམས་ལ་སྨྲས་པ། སྣ་བོ་དག་ཁྱེད་ཀྱིས་ས་ཕྱོགས་དཀར་ཞིང་དཀར་བ་དག་མཐོང་ངམ།
en: “When he had heard this, King Māndhātṛ said to his ministers, ‘Leaders, do you see that white place?’

source: ལྷ་མཐོང་ལགས་སོ།
en: “ ‘Yes, we do, Your Majesty.’

source: །སྣ་བོ་དག་དེ་ནི་བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་རྣམས་ཀྱི་མ་རྨོས་མ་བཏབ་པའི་འབྲས་སཱ་ལུའི་འབྲུ་ཡིན་ཏེ།
en: “ ‘Leaders, those are grains of rice of the people of Kuru in the north, which does not need plowing or sowing.

source: འདི་ལྟར་བྱང་གི་སྒྲ་མི་སྙན་པའི་མི་རྣམས་ནི་མ་རྨོས་མ་བཏབ་པའི་འབྲས་སཱ་ལུའི་འབྲུ་ལ་ལོངས་སྤྱོད་པ་ཡིན་པས།
en: Thus, the people of Kuru in the north enjoy rice that does not need plowing or sowing.

source: ཁྱེད་ཅག་ཀྱང་དེར་སོང་ནས་མ་རྨོས་མ་བཏབ་པའི་འབྲས་སཱ་ལུའི་འབྲུ་ལ་ལོངས་སྤྱོད་པར་འགྱུར་རོ།
en: Go there and you will enjoy such a kind of rice, too.’

source: །རྒྱལ་པོ་ང་ལས་ནུ་ཆས་པ་ན་རི་རབ་ཀྱི་ངོས་ལོགས་ན་བཀྲ་ཞིང་བཀྲ་བའི་ལྗོན་པ་ཕྲེང་བ་བཀོད་པ་བཞིན་དུ་གྱུར་པ་དག་རྒྱང་རིང་པོ་ཁོ་ན་ནས་མཐོང་ངོ་།
en: “When King Māndhātṛ proceeded, he also saw from a distance very beautiful trees like a row of garlands beside Mount Sumeru.

source: །མཐོང་ནས་ཀྱང་ཡང་གནོད་སྦྱིན་ལྷ་གནས་ལ་སྨྲས་པ། ལྷ་གནས་བཀྲ་ཞིང་བཀྲ་བའི་ལྗོན་པ་ཕྲེང་བ་བཀོད་པ་བཞིན་དུ་གྱུར་པ་ཕ་བི་ཅི་ཞིག་ཡིན།
en: Having seen them, he again asked the yakṣa Divaukasa, ‘Divaukasa, what are those very beautiful trees like a row of garlands?’

source: ལྷ་དེ་རྣམས་ནི་བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་རྣམས་ཀྱི་དཔག་བསམ་གྱི་ཤིང་ལགས་ཏེ།
en: “ ‘Your Majesty, those are the wish-fulfilling trees of the people of Kuru in the north.

source: འདི་ལྟར་བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་རྣམས་ནི་དཔག་བསམ་གྱི་ཤིང་གི་གོས་འཚལ་ལགས་སོ།
en: Thus, the people of Kuru in the north wear clothes produced by the wish-fulfilling trees.

source: །རྒྱལ་པོ་ང་ལས་ནུས་ཐོས་ནས་ཀྱང་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: “Having heard this, King Māndhātṛ

source: སྣ་བོ་དག་ཁྱེད་ཀྱིས་བཀྲ་ཞིང་བཀྲ་བའི་ལྗོན་པ་ཕྲེང་བ་བཀོད་པ་བཞིན་དུ་གྱུར་པ་དག་མཐོང་ངམ།
en: said to his ministers, ‘Leaders, do you see those very beautiful trees like a row of garlands?’

source: །སྣ་བོ་དག་དེ་རྣམས་ནི་བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་རྣམས་ཀྱི་དཔག་བསམ་གྱི་གོས་ཀྱི་ཤིང་ཡིན་ཏེ།
en: “ ‘Leaders, those are the wish-fulfilling trees of the people of Kuru in the north.

source: འདི་ལྟར་བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་རྣམས་ནི་དཔག་བསམ་གྱི་ཤིང་གི་གོས་གྱོན་པ་ཡིན་གྱིས།
en: Thus, the people of Kuru in the north wear clothes produced by the wish-fulfilling trees.

source: ཁྱེད་ཀྱང་དེར་སོན་ནས་དཔག་བསམ་གྱི་ཤིང་གི་གོས་གྱོན་པར་འགྱུར་རོ།
en: Go there and you will wear the clothes produced by the wish-fulfilling trees, too.’

source: །རྒྱལ་པོ་ང་ལས་ནུ་བྱང་གི་སྒྲ་མི་སྙན་དུ་སོང་སྟེ།
en: “King Māndhātṛ

source: རྒྱལ་པོ་ང་ལས་ནུ་བྱང་གི་སྒྲ་མི་སྙན་དུ་འདུག་ནས།
en: then went to Kuru in the north and lived there.

source: རྫུ་འཕྲུལ་ཆེན་པོས་རང་གི་བསོད་ནམས་ཀྱི་འབྲས་བུ་མྱོང་བ་ལྟར་བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་དུ་ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་རང་གི་དཔུང་གི་ཚོགས་རྣམས་ལ་རྗེས་སུ་བསྟན་ཏོ།
en: commanded his army in the continent of Kuru in the north for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: །དེ་དེ་ན་རང་གི་དཔུང་གི་ཚོགས་ལ་རྗེས་སུ་སྟོན་པ་ལ་བརྒྱ་བྱིན་དྲུག་ཤི་འཕོས་པ་ལོན་ནོ།
en: While he was commanding his army there, six successive Śakras died. “Again, King Māndhātṛ

source: །ཡང་རྒྱལ་པོ་ང་ལས་ནུས་གནོད་སྦྱིན་ལྷ་གནས་ལ་སྨྲས་པ། བཀའ་འོག་ཏུ་མ་ཆུད་པའི་གླིང་གཞན་འགའ་ལྟ་ཡོད་དམ།
en: asked the yakṣa Divaukasa, ‘‘Is there any other continent where they do not obey my orders?’

source: ལྷ་མ་མཆིས་སོ།
en: “ ‘No, Your Majesty, there is not.

source: །འོན་ཀྱང་ལྷ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་ཚེ་རིང་བ། ཁ་དོག་དང་ལྡན་པ། བདེ་བ་མང་ཞིང་གཞལ་མེད་ཁང་མཐོན་པོ་ན་ཡུན་རིང་དུ་གནས་པ་དག་མཆིས་ཀྱིས།
en: But the Thirty-Three Gods enjoy long lives, excellent figures, and much happiness, and they live in a high heavenly palace for a long time.

source: ཀྱེ་མ་ལྷ་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལ་གཟིགས་སུ་བཞུད་ཅིག །དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Your Majesty should now go to see the Thirty-Three Gods!’

source: བདག་ལ་འཛམ་བུའི་གླིང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་བ་ཡང་ཡོད།
en: “The king thought, ‘I have the continent of Jambu, which is rich, prosperous, peaceful, abundant in food, and full of many people.

source: བདག་གི་ཕོ་བྲང་གི་ནང་དུ་ཡང་རིན་པོ་ཆེའི་ཆར་ཞག་བདུན་དུ་ཕབ།
en: Also, a rain of jewels fell in my palace for seven days.

source: བདག་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་དུ་ཡང་སོང་སྟེ།
en: I went to the continent of Videha in the east, too.

source: ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་བདག་གིས་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་དུ་རྗེས་སུ་བསྟན།
en: I ruled over the continent of Videha in the east for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: བདག་ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཀྱི་གླིང་དུ་ཡང་སོང་སྟེ་ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་བདག་གིས་ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཀྱི་གླིང་དུ་རྗེས་སུ་བསྟན།
en: I went to the continent of Godānīya in the west, too. I ruled over the continent of Godānīya in the west for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: བདག་བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་དུ་ཡང་སོང་སྟེ་ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་བདག་གིས་བྱང་གི་སྒྲ་མི་སྙན་གྱི་གླིང་དུ་རང་གི་དཔུང་གི་ཚོགས་ལ་རྗེས་སུ་བསྟན་ན།
en: I went to the continent of Kuru in the north, too. I commanded my army in the continent of Kuru in the north for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་ཚེ་རིང་བ། ཁ་དོག་དང་ལྡན་པ། བདེ་བ་མང་ཞིང་གཞལ་མེད་ཁང་མཐོན་པོ་ན་ཡུན་རིང་དུ་གནས་པ་དག་ཅིག་ཡོད་ཅེས་གྲག་གིས།
en: But it is said that the Thirty-Three Gods enjoy long lives, excellent figures, and much happiness, and they live in a high heavenly palace for a long time.

source: མ་ལ་བདག་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་བལྟ་བའི་ཕྱིར་འགྲོའོ་སྙམ་པ་དང་། སེམས་བསྐྱེད་མ་ཐག་ཏུ་རྒྱལ་པོ་ང་ལས་ནུ་དཔུང་གི་ཚོགས་བྱེ་བ་བརྒྱད་འབུམ་དང་། ཐབས་ཅིག་ཏུ་བུ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ནས་མདུན་ནས་འགྲོ་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ཏེ་ཆས་སོ།
en: I will now go to see the Thirty-Three Gods.’ “As soon as he had thought this, King Māndhātṛ flew with an army of eight trillion up into the sky, surrounded by his thousand sons and preceded by his seven treasures.

source: །རིའི་རྒྱལ་པོ་རི་རབ་ནི་གསེར་གྱི་རི་བོ་བདུན་གྱིས་བསྐོར་བ་ཡིན་པས།
en: “Mount Sumeru, the king of mountains, is surrounded by seven golden mountains. King Māndhātṛ

source: དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུ་གསེར་གྱི་རི་བོ་མུ་ཁྱུད་འཛིན་ལ་གནས་ཏེ།
en: stayed on golden Mount Nimindhara.

source: དེ་དེ་ན་རང་གི་དཔུང་གི་ཚོགས་ལ་རྗེས་སུ་སྟོན་པ་ལ་བརྒྱ་བྱིན་དྲུག་ཤི་འཕོས་པ་ལོན་ནོ།
en: While he was commanding his army there, six successive Śakras died.

source: །རི་བོ་མུ་ཁྱུད་འཛིན་ནས་གསེར་གྱི་རི་བོ་རྣམ་པར་འདུད་ལ་འདུག་སྟེ།
en: He then went from Mount Nimindhara to golden Mount Vinataka and stayed there.

source: །རི་བོ་རྣམ་པར་འདུད་ནས་གསེར་གྱི་རི་བོ་རྟ་རྣ་ལ་འདུག་སྟེ།
en: He then went from Mount Vinataka to golden Mount Aśvakarṇa.

source: །རི་བོ་རྟ་རྣ་ནས་གསེར་གྱི་རི་བོ་བལྟ་ན་སྡུག་ལ་འདུག་སྟེ།
en: He then went from Mount Aśvakarṇa to golden Mount Sudarśana.

source: །རི་བོ་བལྟ་ན་སྡུག་ནས་གསེར་གྱི་རི་བོ་སེང་ལྡེང་ཅན་ལ་འདུག་སྟེ།
en: He then went from Mount Sudarśana to golden Mount Khadiraka.

source: །རི་བོ་སེང་ལྡེང་ཅན་ནས་གསེར་གྱི་རི་བོ་གཤོལ་མདའ་འཛིན་ལ་འདུག་སྟེ།
en: He then went from Mount Khadiraka to golden Mount Īṣādhāra.

source: །རི་བོ་གཤོལ་མདའ་འཛིན་ནས་གསེར་གྱི་རི་བོ་གཉའ་ཤིང་འཛིན་ལ་འདུག་སྟེ།
en: He then went from Mount Īṣādhāra to golden Mount Yugandhara.

source: དེ་དེ་ན་རང་གི་དཔུང་གི་ཚོགས་ལ་རྗེས་སུ་སྟོན་པ་ལ་བརྒྱ་བྱིན་དྲུག་ཤི་འཕོས་པ་ལོན་ནོ།། །།
en: While he was commanding his army there, six successive Śakras died.

source: མུ་ཁྱུད་འཛིན་དང་རྣམ་པར་འདུད།
en: Nimindhara, Vinataka,

source: །དེ་བཞིན་རི་བོ་རྟ་རྣ་དང་། །བལྟ་ན་སྡུག་དང་སེང་ལྡེང་ཅན།
en: Likewise Aśvakarṇa, Sudarśana, Khadiraka,

source: །གཤོལ་མདའ་འཛིན་དང་གཉའ་ཤིང་འཛིན།
en: Īṣādhāra, and Yugandhara.

source: །རི་བོ་གཉའ་ཤིང་འཛིན་ནས་སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ཏེ་ཆས་པ་ན་རི་རབ་ཀྱི་བང་རིམ་དེ་ལ་དྲང་སྲོང་ལྔ་བརྒྱ་པོ་དེ་རྣམས་གནས་ཏེ།
en: “He then flew up into the sky from Mount Yugandhara and departed. The five hundred ṛṣis were living on the terrace of Mount Sumeru.

source: དེ་རྣམས་ཀྱིས་རྒྱལ་པོ་དེ་འོང་བ་མཐོང་ནས་དེ་རྣམས་ཀྱིས་སྨྲས་པ། ཤེས་ལྡན་དག་རྒྱལ་པོ་འཐབ་ཀྲོལ་ཅན་འདི་འོང་ངོ་།
en: They saw the king coming and said, ‘Sirs, that quarrelsome king is coming.’

source: །དེ་ན་དྲང་སྲོང་བཞིན་ངན་ཞེས་བྱ་བ་དེས་སྐྱོར་བར་ཆུ་བླུགས་ཏེ་གཏོར་བས་དཔུང་གི་ཚོགས་རྣམས་ཐོགས་པར་གྱུར་པ་དང་། དེའི་མདུན་ནས་བློན་པོ་རིན་པོ་ཆེ་འགྲོ་བས་དེས་དྲང་སྲོང་དེ་རྣམས་ལ་སྨྲས་པ།
en: “Then the ṛṣi named Durmukha scooped up water with his hands and scattered it so that the army was blocked. The most treasured minister went before him and said to the ṛṣis:

source: བྲམ་ཟེ་ཁྲོ་བ་དོར་བར་གྱིས།
en: “ ‘O brahmin, free yourself from anger;

source: །འདི་ནི་ཀུན་ལ་འགྲུབ་པ་ཡིན།
en: It will never be completed in anything.

source: །འདི་ནི་མི་དབང་ང་ལས་ནུ།
en: This is Māndhātṛ, the master of people;

source: །བྱ་གར་དེ་དག་མ་ཡིན་ནོ།
en: It’s not those birds.’

source: །ཇི་ཙམ་ན་རྒྱལ་པོ་ང་ལས་ནུ་ཕྱོགས་དེར་ཕྱིན་ནས་སྨྲས་པ།
en: “Then, having arrived at that place, King Māndhātṛ

source: དཔུང་གི་ཚོགས་འདི་སུ་ཞིག་གིས་བཀག །
en: demanded, ‘Who has blocked this army?’

source: བློན་པོ་རིན་པོ་ཆེས་སྨྲས་པ། དྲང་སྲོང་རྣམས་ཀྱིས་སོ།
en: “ ‘The ṛṣis have,’ answered the most treasured minister.

source: །རྒྱལ་པོས་སྨྲས་པ། དྲང་སྲོང་འདི་རྣམས་ནང་ན་ཅི་ཞིག་ལ་དགའ། དེས་སྨྲས་པ།
en: “ ‘What do these ṛṣis most cherish?’ asked the king.

source: ལྷ་རལ་པ་ལ་དགའ་ལགས་སོ། །རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘Your Majesty,’ replied the minister, ‘they most cherish their locks of hair.’

source: འདི་རྣམས་རལ་པ་བྱི་ནས་བདག་གི་མདུན་ནས་འགྲོ་བར་གྱུར་ཅིག་ཅེས་བྱས་པ་དང་། དེ་ནས་དེ་རྣམས་ཀྱི་རལ་པ་བྱི་ནས་ལག་ན་མདའ་གཞུ་ཐོགས་ཏེ་མདུན་དུ་བརྒྱུག་པར་བརྩམས་པ་དང་། བུད་མེད་རིན་པོ་ཆེས་རྒྱལ་པོ་ལ་གསོལ་པ། ལྷ་དྲང་སྲོང་འདི་རྣམས་ནི་དཀའ་ཐུབ་ཅན་ལགས་ན་འདི་དག་ཅི་བགྱི་ཐོང་ལགས།
en: “The king said, ‘May these people have their locks of hair fall out and become my attendants.’ The locks of their hair then did fall out, and they began to run before the king, holding bows and arrows in their hands. “ ‘Your Majesty,’ said the most treasured woman to the king, ‘these ṛṣis are ascetics; what use are they?

source: རྒྱལ་པོས་བཏང་བ་དང་། དེ་རྣམས་ཀྱིས་སླར་ཡང་བརྩོན་འགྲུས་ལ་གནས་ནས་མངོན་པར་ཤེས་པ་ལྔ་མངོན་སུམ་དུ་བྱས་སོ།
en: Please release them.’ “When the king had released them, they recovered their vigor and actualized the five kinds of supernormal knowledge again.

source: །རྒྱལ་པོ་ང་ལས་ནུ་ཡང་དཔུང་གི་ཚོགས་དང་ནམ་མཁའ་ལ་འཕགས་ཏེ་ཆས་སོ།
en: King Māndhātṛ again flew up into the sky together with his army.

source: །རི་རབ་རིའི་རྒྱལ་པོ་དཔག་ཚད་བརྒྱད་ཁྲི་ནི་འོག་ཏུ་གསེར་གྱི་ས་གཞི་ལ་ཐུག་པར་འདུག་གོ།
en: “Mount Sumeru, the king of mountains, touches the golden ground eighty thousand yojanas below sea level;

source: །དཔག་ཚད་བརྒྱད་ཁྲི་ནི་ཆུའི་སྟེང་དུ་བྱུང་སྟེ།
en: another eighty thousand yojanas appear above the water.

source: དེ་ལྟར་དཔག་ཚད་འབུམ་དྲུག་ཁྲི་ཡོད་དོ།
en: Thus, the mountain is one hundred sixty thousand yojanas in total.

source: །དེའི་ངོས་རེ་རེ་ལ་ཡང་དཔག་ཚད་བརྒྱད་ཁྲི་ཡོད་དེ། དེ་ནི་ཁོར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་སུམ་འབུམ་ཉི་ཁྲི་ཡོད་དོ།
en: Each side of it is eighty thousand yojanas long, and thus the mountain is three hundred twenty thousand yojanas in circumference.

source: །རིན་པོ་ཆེ་སྣ་བཞིའི་རང་བཞིན་བཟང་པོ་མཛེས་པ། བལྟ་ན་སྡུག་པ་ཡིན་ནོ། །དེའི་སྟེང་ན་ལྷ་སུམ་བཅུ་རྩ་གསུམ་པ་རྣམས་གནས་ཏེ།
en: Consisting of four kinds of precious substances, it is excellent, beautiful, and pleasant to behold. The Thirty-Three Gods live on its summit.

source: སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་སྲུང་མ་ལྔ་པོ་ཆུ་ལ་གནས་པའི་ཀླུ་རྣམས་དང་། གནོད་སྦྱིན་ལག་ན་ཡོལ་གོ་ཐོགས་པ་རྣམས་དང་། ཕྲེང་ཐོགས་རྣམས་དང་། རྟག་ཏུ་མྱོས་རྣམས་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་རྣམས་བཀོད་པ་ལ།
en: Their five kinds of guards are deployed there, namely, aquatic nāgas, karoṭapāṇi yakṣas, mālādhāras, sadāmattas, and the Four Great Kings.

source: ཆུ་ན་གནས་པ་རྣམས་ཀྱིས་རྒྱལ་པོ་ང་ལས་ནུའི་དཔུང་གི་ཚོགས་རྣམས་བཀག་པ་དང་། ཇི་ཙམ་ན་རྒྱལ་པོ་ང་ལས་ནུ་ཕྱོགས་དེར་ཕྱིན་ནས་སྨྲས་པ།
en: “When the aquatic nāgas blocked King Māndhātṛ’s army, King Māndhātṛ

source: དཔུང་གི་ཚོགས་འདི་སུ་ཞིག་གིས་བཀག །དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: arrived at that place and asked, ‘Who has blocked this army?’

source: ལྷ་ཆབ་ན་གནས་པའི་ཀླུ་རྣམས་ཀྱིས་སོ།
en: “ ‘Aquatic nāgas have,’ the members of the army answered.

source: །རྒྱལ་པོས་སྨྲས་པ། བདག་དུད་འགྲོ་རྣམས་དང་གཡུལ་འགྱེད་དམ། དེས་སྨྲས་པ།
en: “ ‘Am I fighting animals?’ wondered the king.

source: ཆུ་ལ་གནས་པའི་ཀླུ་འདི་དག་ཉིད་བདག་གི་མདུན་ནས་འགྲོ་བར་གྱུར་ཅིག་ཅེས་བྱས་པ་དང་། དེ་རྣམས་རྒྱལ་པོ་ང་ལས་ནུའི་མདུན་ནས་འགྲོ་བར་ཆས་སོ།
en: “Then he said, ‘May these aquatic nāgas become my attendants.’

source: །ཇི་ཙམ་ན་ཀླུ་དེ་རྣམས་རྒྱལ་པོ་ང་ལས་ནུའི་མདུན་ནས་རྒྱུག་ཅིང་།
en: “They began to go before King Māndhātṛ, and then these nāgas arrived where the karoṭapāṇi gods were.

source: ལྷ་ལག་ན་ཡོལ་གོ་ཐོགས་ཀྱི་དྲུང་དུ་ཕྱིན་པ་དང་། དེ་རྣམས་ཀྱིས་དེ་དག་ལ་དྲིས་པ། ཤེས་ལྡན་དག་ཅི་སྟེ་རྒྱུག །དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: The gods asked them, ‘Sirs, why are you going?’

source: འདིར་མིའི་རྒྱལ་པོ་འོང་ངོ་།
en: “ ‘A human king is coming here,’ they answered.

source: །དེ་ནས་ཀླུ་དེ་རྣམས་དང་། ལྷ་ལག་ན་ཡོལ་གོ་ཐོགས་རྣམས་ལོག་ནས་ཡང་དཔུང་གི་ཚོགས་དེ་ཐོགས་པར་བྱས་སོ།
en: “Then the nāgas and karoṭapāṇi gods turned back and blocked the army again. King Māndhātṛ

source: །ཇི་ཙམ་ན་རྒྱལ་པོ་ང་ལས་ནུ་འོངས་ནས་དེས་སྨྲས་པ། དཔུང་གི་ཚོགས་འདི་སུ་ཞིག་གིས་བཀག །དེས་སྨྲས་པ།
en: came and asked, ‘Who has blocked this army?’

source: ལྷ་ལྷ་ལག་ན་ཡོལ་གོ་ཐོགས་འདི་རྣམས་ཀྱིས་དཔུང་གི་ཚོགས་བཀག་ལགས་སོ།
en: “ ‘Your Majesty, these karoṭapāṇi gods have blocked the army,’ the members of the army answered.

source: །རྒྱལ་པོ་ང་ལས་ནུས་སྨྲས་པ།
en: “King Māndhātṛ

source: ལྷ་ལག་ན་ཡོལ་གོ་ཐོགས་འདི་དག་ཉིད་བདག་གི་མདུན་ནས་འགྲོ་བར་གྱུར་ཅིག་དེ་ནས་དེ་རྣམས་མདུན་ནས་རབ་ཏུ་བརྒྱུགས་ཏེ།
en: said, ‘May these karoṭapāṇi gods become my attendants.’

source: ཇི་ཙམ་ན་ཀླུ་དེ་རྣམས་དང་ལྷན་ཅིག་ལྷ་ཕྲེང་ཐོགས་རྣམས་ཀྱི་དྲུང་དུ་ཕྱིན་པ་དང་། དེ་རྣམས་ཀྱིས་དེ་དག་ལ་དྲིས་པ།
en: “Then they began to run before King Māndhātṛ with the nāgas, and they arrived where the mālādhāra gods were.

source: ཤེས་ལྡན་དག་ཅི་སྟེ་རྒྱུག་དེ་དག་གིས་སྨྲས་པ།
en: Those gods asked them, ‘Sirs, why are you running?’

source: མིའི་རྒྱལ་པོ་འདིར་འོང་ངོ་།
en: “ ‘A human king is coming here,’ they answered.

source: །དེ་ནས་ལྷ་དང་། ཀླུ་དེ་རྣམས་ཡང་ལོག་ནས་དཔུང་གི་ཚོགས་ཐོགས་པར་བྱས་པ་དང་། རྒྱལ་པོ་ཕྱོགས་དེར་ཕྱིན་ནས་དེས་སྨྲས་པ། དཔུང་གི་ཚོགས་འདི་སུ་ཞིག་གིས་བཀག་དེས་སྨྲས་པ།
en: “Then the gods and nāgas turned back and blocked the army again. The king arrived at that place and asked, ‘Who has blocked this army?’

source: ལྷ་ལྷ་ཕྲེང་ཐོགས་རྣམས་ཀྱིས་སོ། །རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘Your Majesty, the mālādhāra gods have,’ the members of the army answered.

source: ལྷ་ཕྲེང་ཐོགས་འདི་དག་ཉིད་བདག་གི་མདུན་ནས་འགྲོ་བར་གྱུར་ཅིག །དེ་ནས་དེ་རྣམས་མདུན་ནས་བརྒྱུག་པར་བརྩམས་སོ།
en: “The king said, ‘May these mālādhāra gods become my attendants.’ “Then they began to run before him, and they arrived where the sadāmatta gods were.

source: །དེ་རྣམས་ཀྱིས་བརྒྱུགས་ནས་ལྷ་རྟག་ཏུ་མྱོས་རྣམས་ཀྱི་དྲུང་དུ་ཕྱིན་པ་དང་། དེ་རྣམས་ཀྱིས་དེ་དག་ལ་དྲིས་པ། ཤེས་ལྡན་དག་ཅི་སྟེ་རྒྱུག །
en: Those gods asked them, ‘Sirs, why are you running?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། མིའི་རྒྱལ་པོ་འདིར་འོང་ངོ་།
en: “ ‘A human king is coming here,’ they answered.

source: །དེ་ནས་དེ་རྣམས་ལོག་ནས་ཡང་དཔུང་གི་ཚོགས་དེ་ཐོགས་པར་བྱས་པ་དང་། རྒྱལ་པོ་ཕྱོགས་དེར་ཕྱིན་ནས་དེས་སྨྲས་པ། དཔུང་གི་ཚོགས་འདི་སུ་ཞིག་གིས་བཀག་དེས་སྨྲས་པ།
en: “Then they turned back and blocked the army again. The king arrived at that place and asked, ‘Who has blocked this army?’

source: ལྷ་ལྷ་རྟག་ཏུ་མྱོས་རྣམས་ཀྱིས་སོ།
en: “ ‘Your Majesty, the sadāmatta gods have,’ the members of the army answered.

source: །རྒྱལ་པོས་སྨྲས་པ། ལྷ་རྟག་ཏུ་མྱོས་འདི་དག་ཉིད་བདག་གི་མདུན་ནས་འགྲོ་བར་གྱུར་ཅིག །དེ་ནས་དེ་རྣམས་མདུན་ནས་བརྒྱུགས་སོ།
en: “The king said, ‘May these sadāmatta gods become my attendants.’

source: །དེ་རྣམས་ཀྱིས་བརྒྱུགས་ནས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་དྲུང་དུ་ཕྱིན་པ་དང་། དེ་རྣམས་ཀྱིས་དེ་དག་ལ་དྲིས་པ།
en: “Then they began to run before him, and went to the gods attendant on the Four Great Kings.

source: ཤེས་ལྡན་དག་ཅི་སྟེ་རྒྱུག །མིའི་རྒྱལ་པོ་འདིར་འོང་ངོ་།
en: Those gods asked them, ‘Sirs, why are you running?’ “ ‘A human king is coming here.’

source: །རྒྱལ་ཆེན་བཞིའི་རྣམས་ཀྱིས་བསམས་པ། སེམས་ཅན་འདི་ནི་བསོད་ནམས་ཀྱི་མཐུ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་ཏེ་དེ་དགག་པར་མི་ནུས་སོ་སྙམ་ནས།
en: “The Four Great Kings thought, ‘This being seems to have the great power of merit. We cannot block them.’

source: དེ་ནས་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་དེ་རྣམས་ཀྱིས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ལ་འདིར་མིའི་རྒྱལ་པོ་ང་ལས་ནུ་འོང་ངོ་ཞེས་སྦྲན་ཏོ། །སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱིས་བསམས་པ། སེམས་ཅན་འདི་ནི་བསོད་ནམས་ཀྱི་མཐུ་ཆེན་པོ་དང་ལྡན་པ་ཡིན་པས་དེ་བཟློག་པར་མི་བྱའི་མཆོད་ཡོན་གྱིས་བསུ་བར་བྱའོ་སྙམ་ནས། དེ་ནས་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་དེ་རྣམས་ཀྱིས་མཆོད་ཡོན་གྱིས་བསུའོ། །རྒྱལ་པོ་ང་ལས་ནུ་རི་རབ་ཀྱི་རྩེ་ལ་འཛེག་པ་ན་ཚལ་སྔོ་ཞིང་སྔོ་བའི་ཕྲེང་བ་སྤྲིན་སྤུངས་པ་ལྟ་བུ་མཐོན་པོ་དག་མཐོང་ངོ་།
en: “Then the gods attendant on the Four Great Kings informed the Thirty-Three Gods, ‘A human king is coming here.’ The Thirty-Three Gods thought, ‘Since this being seems to have the great power of merit, we should not obstruct him but welcome him with offerings.’ Then the Thirty-Three Gods did welcome him with offerings. “When King Māndhātṛ

source: །མཐོང་ནས་ཀྱང་གནོད་སྦྱིན་ལྷ་གནས་ལ་སྨྲས་པ། ལྷ་གནས་ཚལ་སྔོ་ཞིང་སྔོ་བའི་ཕྲེང་བ་སྤྲིན་སྤུངས་པ་ལྟ་བུ་མཐོན་པོ་ཕ་བི་དག་ཅི་ཞིག་ཡིན།
en: stood at the summit of Mount Sumeru, he saw a green chain of forests like billowing clouds and asked the yakṣa Divaukasa, ‘Divaukasa, what is that green chain of forests like billowing clouds?’

source: ལྷ་དེ་ནི་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ཤིང་ཡོངས་འདུས་བརྟོལ་ཞེས་བགྱི་བ་ལགས་ཏེ། སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དབྱར་ཟླ་བ་བཞི་ལྷའི་འདོད་པའི་ཡོན་ཏན་ལྔ་དང་འབྱོར་ཅིང་ལྡན་པར་དེ་ན་རྩེ་བར་བགྱིད། དགའ་བར་བགྱིད།
en: “ ‘Your Majesty, that is the forest of the Thirty-Three Gods’ kovidāra trees, whose name is Pāriyātraka. The Thirty-Three Gods play, amuse themselves, and enjoy themselves there for the four months of the rainy season, obtaining and owning the divine objects of the five kinds of desires.

source: དགའ་མགུར་སྤྱོད་པར་བགྱིད་དོ། །ལྷ་ཡང་དེར་བྱོན་ནས་ལྷའི་འདོད་པའི་ཡོན་ཏན་ལྔ་དང་འབྱོར་ཅིང་ལྡན་པར་རོལ་བར་མཛད། དགྱེས་པར་མཛད།
en: Your Majesty should go there and play, amuse himself, and enjoy himself, possessing and owning the divine objects of the five kinds of desires, too.’

source: དགྱེས་མགུར་སྤྱད་པར་མཛོད་ཅིག་རྒྱལ་པོ་ང་ལས་ནུས་ཐོས་ནས་ཀྱང་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: “Having heard this, King Māndhātṛ

source: སྣ་བོ་དག་ཁྱེད་ཅག་གིས་ཚལ་སྔོ་ཞིང་སྔོ་བའི་ཕྲེང་བ་སྤྲིན་སྤུངས་པ་ལྟ་བུ་མཐོན་པོ་དག་མཐོང་ངམ།
en: asked the ministers, ‘Leaders, do you see that green chain of forests like billowing clouds?’

source: །སྣ་བོ་དག་དེ་ནི་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་ཤིང་ཡོངས་འདུ་ས་བརྟོལ་ཅེས་བྱ་བ་ཡིན་ཏེ།
en: “ ‘Leaders, that is the Thirty-Three Gods’ kovidāra tree, whose name is Pāriyātraka.

source: སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དབྱར་ཟླ་བ་བཞི་ལྷའི་འདོད་པའི་ཡོན་ཏན་ལྔ་དང་འབྱོར་ཅིང་ལྡན་པར་དེ་ན་རྩེ་བར་བྱེད། དགའ་བར་བྱེད། དགའ་མགུར་སྤྱོད་པར་བྱེད་ཀྱིས།
en: The Thirty-Three Gods play, amuse themselves, and enjoy themselves there for the four months of the rainy season, obtaining and owning the divine objects of the five kinds of desires.

source: སྣ་བོ་དག་ཁྱེད་ཅག་ཀྱང་དེར་ཕྱིན་ནས་འདོད་པའི་ཡོན་ཏན་ལྔ་དང་འབྱོར་ཅིང་ལྡན་པར་རྩེ་བར་གྱིས། དགའ་བར་གྱིས་དགའ་མགུར་སྤྱད་པར་གྱིས་ཤིག །
en: Leaders, you should go there and play, amuse yourselves, and enjoy yourselves, obtaining and owning the divine objects of the five kinds of desires, too.’

source: ཡང་རྒྱལ་པོ་ང་ལས་ནུས་རི་རབ་ཀྱི་རྩེ་ན་དཀར་ཞིང་དཀར་བ་སྤྲིན་སྤུངས་པ་ལྟ་བུ་མཐོན་པོ་ཞིག་མཐོང་ངོ་།
en: “Again, on the summit of Mount Sumeru, after King Māndhātṛ

source: །མཐོང་ནས་ཀྱང་གནོད་སྦྱིན་ལྷ་གནས་ལ་སྨྲས་པ། ལྷ་གནས་དཀར་ཞིང་དཀར་བ་སྤྲིན་སྤུངས་པ་ལྟ་བུ་མཐོན་པོ་ཕ་བི་ཅི་ཞིག་ཡིན།
en: saw a high, white object resembling billowing clouds, he asked the yakṣa Divaukasa, ‘Divaukasa, what is that high, white object resembling billowing clouds?’

source: ལྷ་དེ་ནི་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་འདུན་ས་ཆོས་བཟང་ལགས་ཏེ།
en: “Your Majesty, that is the Thirty-Three Gods’ meeting hall, Sudharmā.

source: སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་། རྒྱལ་ཆེན་བཞི་རྣམས་དེར་འདུས་ཤིང་ཚོགས་ནས་ལྷ་དང་མི་རྣམས་ཀྱི་དོན་སེམས་པར་བགྱིད། འཇལ་བར་བགྱིད། ཉེ་བར་རྟོག་པར་བགྱིད་དེ།
en: The Thirty-Three Gods and the Four Great Kings meet together there and think, measure, and investigate divine and human matters.

source: ལྷ་ཡང་དེར་བཞུད་པར་འགྱུར་རོ།
en: Your Majesty will go there, too.’

source: །རྒྱལ་པོ་ང་ལས་ནུས་ཐོས་ནས་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: “Having heard this, King Māndhātṛ

source: སྣ་བོ་དག་ཁྱེད་ཅག་གིས་དཀར་ཞིང་དཀར་བ་སྤྲིན་སྤུངས་པ་ལྟ་བུ་མཐོན་པོ་མཐོང་ངམ།
en: asked the ministers, ‘Leaders, do you see that high, white object resembling billowing clouds?’

source: །སྣ་བོ་དག་དེ་ནི་སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་འདུན་ས་ཆོས་བཟང་ཞེས་བྱ་བ་ཡིན་ཏེ།
en: “ ‘Leaders, that is the Thirty-Three Gods’ meeting hall, Sudharmā.

source: སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་། རྒྱལ་ཆེན་བཞི་རྣམས་དེར་འདུས་ཤིང་ཚོགས་ནས་ལྷ་དང་མི་རྣམས་ཀྱི་དོན་སེམས་པར་བྱེད། འཇལ་བར་བྱེད། ཉེ་བར་རྟོག་པར་བྱེད་དེ།
en: The Thirty-Three Gods and the Four Great Kings meet together there and think, measure, and investigate divine and human matters.

source: སྣ་བོ་དག་ཁྱེད་ཅག་ཀྱང་དེར་འགྲོ་བར་འགྱུར་རོ།
en: Leaders, you will go there, too.’

source: །སུམ་བཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་གྲོང་ཁྱེར་བལྟ་ན་སྡུག་ཅེས་བྱ་བ་ནི་ཆུ་དང་ཞེང་དུ་དཔག་ཚད་ཉིས་སྟོང་ལྔ་བརྒྱ་ཡོད་དེ། ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་ཁྲི་ཡོད་པ།
en: “The Thirty-Three Gods’ city, Sudarśana, is two thousand five hundred yojanas in length and width, and thus ten thousand yojanas in circumference.
